.xmonad/xmonad.tex
\section{My keybinding}
\label{sec:org187722c}
The most important section, I used the \emph{classic scheme} for the workspace workflow, and EZ way for all the others.
I didn't know how to set the bindings for the workspace handling in the EZ way\ldots{}
I prefer the EZ way, even if it's harder to find and correct an error, because is more readable and more easy to write and remember the Emacs keybindings.
\begin{verbatim}
myKeys conf@(XConfig {XMonad.modMask = modKey}) = M.fromList $
    [((m .|. modKey, k), windows $ f i)
        | (i, k) <- zip (XMonad.workspaces conf) ([xK_1 .. xK_9] ++ [xK_0])
        , (f, m) <- [(W.greedyView, 0), (W.shift, shiftMask)]]

myAdditionalKeys = [ -- Basic keybindings
                     ("M-<Return>"  , spawn $ myTerminal) 
                   , ("M1-C-t"      , spawn $ myFallbackTerminal)
                   , ("M-d"         , spawn myLauncher)
                   , ("M-w"         , spawn myBrowser)
                   , ("M-S-w"       , spawn mySecondBrowser)
                   , ("M-v"         , spawn "pavucontrol")
                   , ("M-S-<Return>", spawn myFileManager)
                   , ("M-S-q"       , kill)
                   , ("M-C-S-q"     , killAll)
                   , ("M-<Space>"   , sendMessage NextLayout)
                   , ("M-n"         , refresh)
                   , ("M-<Tab>"     , windows W.focusDown)
                   , ("M-S-<Tab>"   , windows W.focusUp)
                   , ("M1-<Tab>"     , windows W.focusDown)
                   , ("M1-S-<Tab>"   , windows W.focusUp)
                   , ("M-j"         , windows W.focusDown)
                   , ("M-k"         , windows W.focusUp)
                   , ("M-m"         , windows W.focusMaster)
                   , ("M-C-<Return>", windows W.swapMaster)
                   , ("M-S-j"       , windows W.swapDown)
                   , ("M-S-k"       , windows W.swapUp)
                   , ("M-h"         , sendMessage Shrink)
                   , ("M-l"         , sendMessage Expand)
                   , ("M-t"         , withFocused $ windows . W.sink)
                   , ("M-,"         , prevWS)
                   , ("M-."         , nextWS)
                   , ("M-S-,"       , prevScreen)
                   , ("M-S-."       , nextScreen)
                   , ("M-f"         , sendMessage $ Toggle FULL)
                   , ("M-S-f"       , sendMessage (T.Toggle "floats"))
                   , ("M-S-x"       , io (exitWith ExitSuccess))
                   , ("M-x"         , spawn $ "xmonad --recompile && xmonad --restart")
                   , ("M-<Esc>"     , spawn $ "xkill")

                   -- Layout shortcut
                   , ("M-S-l 0"     , sendMessage $ JumpToLayout "tall")
                   , ("M-S-l S-0"   , sendMessage $ JumpToLayout "mirrorTall")
                   , ("M-S-l a"     , sendMessage $ JumpToLayout "accordion")
                   , ("M-S-l S-a"   , sendMessage $ JumpToLayout "wideAccordion")
                   , ("M-S-l t"     , sendMessage $ JumpToLayout "tabs")
                   , ("M-S-l f"     , sendMessage $ JumpToLayout "monocle")
                   , ("M-S-l b"     , sendMessage $ JumpToLayout "fibonacci")
                   , ("M-S-l g"     , sendMessage $ JumpToLayout "grid")
                   , ("M-S-l 3"     , sendMessage $ JumpToLayout "threeCol")
                   , ("M-S-l 2"     , sendMessage $ JumpToLayout "twoPane")
                   , ("M-S-l S-2"   , sendMessage $ JumpToLayout "verticalTwoPane")
                   , ("M-S-l S-f"   , sendMessage $ JumpToLayout "floats")

                   -- Emacs integration
                   , ("M-e"           , spawn myEditor)
                   , ("M-S-e j"       , spawn $ emacsExec ++ "'(dired nil)'" )
                   
                   -- Keybinds to launch app
                   , ("M-a h"       , spawn $ myTerminal ++ " -e htop")
                   , ("M-a u"       , spawn $ myTerminal ++ " -e sudo pacman -Syyu")
                   , ("M-a e"       , spawn $ myTerminal ++ " -e vim")
                   , ("M-a t"       , spawn $ "telegram-desktop")
                   , ("M-a S-t"     , spawn $ "teams")

                   -- GridSelect 
                   , ("M-g g"       , goToSelected $ myGridConfig myColorizer)
                   , ("M-g a"       , spawnSelected' myAppGrid)
                   , ("M-g s"       , spawnSelected' mySysGrid)
                   , ("M-g b"       , bringSelected $ myGridConfig myColorizer)

                   -- Dactyl Manuform 5x7 Hyper key
                   , ("M-M1-C-S-x g", goToSelected $ myGridConfig myColorizer)
                   , ("M-M1-C-S-x a", spawnSelected' myAppGrid)
                   , ("M-M1-C-S-x s", spawnSelected' mySysGrid)
                   , ("M-M1-C-S-x b", bringSelected $ myGridConfig myColorizer)
                   ]

myMouseBindings (XConfig {XMonad.modMask = modMask}) = M.fromList $
    [ ((modMask, button1), (\w -> focus w >> mouseMoveWindow w))
    , ((modMask, button2), (\w -> focus w >> windows W.swapMaster))
    , ((modMask, button3), (\w -> focus w >> mouseResizeWindow w))
    ]

\end{verbatim}
