.xmonad/xmonad.org
* My Layout
The second most important section, all the possible layout are:
+ Master & Stack, with Master on the left
+ Master & Stack, with Master on top
+ Three column, layout with one window on the master
+ Accordion
+ Accordion rotated by 90 degree
+ twoPane, with tabs layout on the master pane
+ verticalTwoPane, identical to twoPane but rotated
+ Spiral, like bspwm, I call it Fibonacci Layout
+ Grid layout, like one of the default in HerbstLuftWm
+ Tabbed, like one of the default layout in I3
+ Floats because... *why not?*
+ Monocle, I don't realy use it, but sometime it can be useful [fn:1]
I have also added a shortcut to jump to the specific layout! (Probably the keybindigs mnemonic make sense only to me)
#+begin_src haskell :tangle xmonad.hs
myLayout = avoidStruts $ mouseResize $ windowArrange $ T.toggleLayouts floats
           $ mkToggle (NOBORDERS ?? FULL ?? EOT) myDefaultLayout
         where
           myDefaultLayout = tall 
                             ||| mirrorTall
                             ||| threeCol
                             ||| tallAccordion
                             ||| wideAccordion
                             ||| twoPane
                             ||| verticalTwoPane
                             ||| spirals
                             ||| grid
                             ||| tabs
                             ||| floats
                             ||| monocle

tall = renamed [Replace "tall"] 
       $ smartBorders
       $ spacing myGaps
--       $ reflectHoriz
       $ Tall 1 (3/100) (1/2)

mirrorTall = renamed [Replace "mirrorTall"]
           $ Mirror tall

spirals = renamed [Replace "fibonacci"] 
        $ smartBorders
        $ addTabs shrinkText myTabTheme
        $ spacing myGaps 
        $ spiral (6/7)

tabs = renamed [Replace "tabs"]
     $ tabbed shrinkText myTabTheme

tallAccordion = renamed [Replace "accordion"]
              $ Accordion

wideAccordion = renamed [Replace "wideAccordion"]
              $ Mirror Accordion

monocle = renamed [Replace "monocle"]
        $ noBorders
        $ addTabs shrinkText myTabTheme
        $ limitWindows 20
        $ Full

grid = renamed [Replace "grid"]
     $ smartBorders
     $ limitWindows 12
     $ spacing myGaps
     $ mkToggle (single MIRROR)
     $ Grid 

threeCol = renamed [Replace "threeCol"]
         $ smartBorders
         $ limitWindows 7
--         $ reflectHoriz
         $ ThreeCol 1 (3/100) (1/3) 

twoPane = renamed [Replace "twoPane"]
        $ smartBorders
        $ addTabs shrinkText myTabTheme
        $ spacing myGaps
        $ reflectHoriz
        $ tabs *|* TwoPane (3/100) (1/2)  
  
verticalTwoPane = renamed [Replace "verticalTwoPane"]
        $ smartBorders
        $ addTabs shrinkText myTabTheme
        $ spacing myGaps
        $ tabs */* TwoPane (3/100) (1/2)  

floats = renamed [Replace "floats"]
       $ smartBorders
       $ limitWindows 20 simplestFloat

myManageHook = composeAll . concat $
    [ [className =? "MPlayer"          --> doFloat]
    , [className =? "Gimp"             --> doFloat]
    , [className =? "guake"            --> doFloat]
    , [title     =? "update-arch"      --> doCenterFloat]
    , [resource  =? "desktop_window"   --> doIgnore] ]

#+end_src
[fn:1] I can toggle to ~Full~ layout with ~M-f~
* My hook
Just the autostart section, I have to learn a little bit more about LogHook.
#+begin_src haskell :tangle xmonad.hs
myLogHook = return ()

myStartupHook = do
    spawnOnce "~/.xmonad/scripts/autostart.sh"
    setWMName "LG3D"
#+end_src
* My config
Applying all the definition above
#+begin_src haskell :tangle xmonad.hs
myConfig = defaultConfig {
        terminal           = myTerminal,
        focusFollowsMouse  = myFocusFollowsMouse,
        borderWidth        = myBorderWidth,
        modMask            = myModMask,
        workspaces         = myWorkspaces,
        normalBorderColor  = myNormalBorderColor,
        focusedBorderColor = myFocusedBorderColor,

        keys               = myKeys,
        mouseBindings      = myMouseBindings,

        layoutHook         = myLayout,
        manageHook         = myManageHook <+> manageDocks,
        logHook            = myLogHook,
        startupHook        = myStartupHook
    }
#+end_src
* Utility
Adding clickable workspace in XMobar
#+begin_src haskell :tangle xmonad.hs
clickable ws = "<action=xdotool key super+"++show i++">"++ws++"</action>"
    where i = fromJust $ M.lookup ws myWorkspaceIndices

windowCount :: X (Maybe String)
windowCount = gets $ Just . show . length . W.integrate' . W.stack . W.workspace . W.current . windowset
#+end_src
* Main function
Starting point of XMonad and XMobar integration
#+begin_src haskell :tangle xmonad.hs
main = do
  xmproc0 <- spawnPipe "xmobar -x 0 ~/.xmonad/xmobarrc0"
--  xmproc1 <- spawnPipe "xmobar -x 1 ~/.xmonad/xmobarrc1"
  xmonad $ ewmh myConfig
    { handleEventHook = docksEventHook
    , logHook         = dynamicLogWithPP $ xmobarPP
                           { ppOutput          = \x -> hPutStrLn xmproc0 x -- xmobar on main monitor
 --                                                   >> hPutStrLn xmproc1 x -- xmobar on secondary monitor
                           , ppCurrent         = xmobarColor "#c678d9" "" . wrap "[" "]"
                           , ppVisible         = xmobarColor "#c678d9" "" . clickable
                           , ppHidden          = xmobarColor "#b48ead" "" . wrap "*" "" . clickable
                           , ppHiddenNoWindows = xmobarColor "#b48ead" "" . clickable
                           , ppTitle           = xmobarColor "#CCCCCC" "" . shorten 60
                           , ppSep             = "<fc=#88c0d0> <fn=2>|</fn> </fc>"
                           , ppUrgent          = xmobarColor "#bf616a" "" . wrap "!" "!" 
                           , ppExtras          = [windowCount]
                           , ppOrder           = \(ws:l:t:ex) -> [ws,l] ++ ex ++ [t]
                           }
    } `additionalKeysP` myAdditionalKeys
#+end_src
* XMobar
Config for XMobar, at a first glance it seems complicated,
but after a little bit I found easy to configure XMobar than polybar.
